In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    { 'col1': [20, 10], 'col2': [40, 30] }
)
df['col1'], df.col1

(0    20
 1    10
 Name: col1, dtype: int64,
 0    20
 1    10
 Name: col1, dtype: int64)

In [3]:
df = pd.DataFrame(
    { 'col1': [20, 10], 'col2': [40, 30] },
    index = ['f', 's']
)
print(df)
print(df.col1.f)
print(df['col1']['f'])
df['col1']['f':], type(df['col1']['f'])
df['col1']['f'] + 7

   col1  col2
f    20    40
s    10    30
20
20

np.int64(27)

In [4]:
df = pd.DataFrame(
    { 'col1': [20, 10], 'col2': [40, 30], 'col3': [60, 50] }
)
df[0:2]
df[['col1', 'col2']]

   col1  col2
0    20    40
1    10    30

In [6]:
df

   col1  col2  col3
0    20    40    60
1    10    30    50

Here we can pass a number which acts as index we can also pass a slice value

In [17]:
'df.iloc[0]', df.iloc[0], 'df.iloc[0:2]', df.iloc[0:2], 'df.iloc[:]', df.iloc[:]

('df.iloc[0]',
 col1    20
 col2    40
 col3    60
 Name: 0, dtype: int64,
 'df.iloc[0:2]',
    col1  col2  col3
 0    20    40    60
 1    10    30    50,
 'df.iloc[:]',
    col1  col2  col3
 0    20    40    60
 1    10    30    50)

The second argument acts as a column here 0 means first column, we can also pass a list of column index as well as list of row index

In [18]:
'df.iloc[0, 0]', df.iloc[0, 0], 'df.iloc[0, [1,2]]', df.iloc[0, [1,2]], 'df.iloc[[0,1], [1,2]]', df.iloc[[0,1], [1,2]]

('df.iloc[0, 0]',
 np.int64(20),
 'df.iloc[0, [1,2]]',
 col2    40
 col3    60
 Name: 0, dtype: int64,
 'df.iloc[[0,1], [1,2]]',
    col2  col3
 0    40    60
 1    30    50)

It's also possible to use negative index in row selection, and we can also use slicing for columns also.

In [29]:
'df.iloc[-1, 0]', df.iloc[-1, 0], 'df.iloc[:, 0:2]', df.iloc[:, 0:2]

('df.iloc[-1, 0]',
 np.int64(10),
 'df.iloc[:, 0:2]',
    col1  col2
 0    20    40
 1    10    30)

In [30]:
df

   col1  col2  col3
0    20    40    60
1    10    30    50

In [34]:
"df.loc[0, 'col2']", df.loc[0, 'col2'], "df.loc[:, 'col2']", df.loc[:, 'col2']

("df.loc[0, 'col2']",
 np.int64(40),
 "df.loc[:, 'col2']",
 0    40
 1    30
 Name: col2, dtype: int64)

In [45]:
print(df.iloc[0, :])
df = pd.DataFrame(
    {'age': [20,22], 'score': [100, 120]},
    index = ['game1', 'game2']
)
df.loc['game2', 'age']
df.loc['game2', :]
print('see', df.iloc[0, :])
df

age       20
score    100
Name: game1, dtype: int64
see age       20
score    100
Name: game1, dtype: int64

       age  score
game1   20    100
game2   22    120

In [50]:
df.loc[['game1', 'game2'], 'age']
df.loc['game1', ['age', 'score']]

age       20
score    100
Name: game1, dtype: int64

In [56]:
df = pd.read_csv('country_region.csv', index_col=0)
df['Argentina':'Egypt'], df

(                  Region
 Country
 Argentina  South America
 Germany           Europe
 France            Europe
 Nigeria           Africa
 Egypt             Africa,
                       Region
 Country
 United States  North America
 Canada         North America
 Brazil         South America
 Argentina      South America
 Germany               Europe
 France                Europe
 Nigeria               Africa
 Egypt                 Africa
 China                   Asia
 India                   Asia
 Australia            Oceania
 New Zealand          Oceania)

In [64]:
df = pd.DataFrame(
    {
        'col1': [2],
        'col2': [2],'col3': [2],'col4': [2]
    }
)
df.loc[0, 'col1':'col3']

col1    2
col2    2
col3    2
Name: 0, dtype: int64

In [74]:
df = pd.read_csv('country_region.csv')
df.set_index('Region')

                     Country
Region
North America  United States
North America         Canada
South America         Brazil
South America      Argentina
Europe               Germany
Europe                France
Africa               Nigeria
Africa                 Egypt
Asia                   China
Asia                   India
Oceania            Australia
Oceania          New Zealand

In [72]:
df

          Country         Region
0   United States  North America
1          Canada  North America
2          Brazil  South America
3       Argentina  South America
4         Germany         Europe
5          France         Europe
6         Nigeria         Africa
7           Egypt         Africa
8           China           Asia
9           India           Asia
10      Australia        Oceania
11    New Zealand        Oceania

In [79]:
df.Region == 'Asia', df['Region'] == 'Europe'

(0     False
 1     False
 2     False
 3     False
 4     False
 5     False
 6     False
 7     False
 8      True
 9      True
 10    False
 11    False
 Name: Region, dtype: bool,
 0     False
 1     False
 2     False
 3     False
 4      True
 5      True
 6     False
 7     False
 8     False
 9     False
 10    False
 11    False
 Name: Region, dtype: bool)

In [82]:
df.loc[df.Region == 'Asia']

  Country Region
8   China   Asia
9   India   Asia

In [88]:
result = (df.Country == 'United States')\
& (df.Region == 'North America')
df.loc[result]

         Country         Region
0  United States  North America

In [89]:
result = (df.Country == 'United States')\
| (df.Region == 'North America')
df.loc[result]

         Country         Region
0  United States  North America
1         Canada  North America

In [93]:
result = df.Country.isin(['Brazil', 'India'])
df.loc[result]

  Country         Region
2  Brazil  South America
9   India           Asia

In [97]:
df = pd.DataFrame(
    { 'col1': [10, None],
      'col2': [20, 30],
    }
)
result = df.col1.notnull()
df.loc[result]

   col1  col2
0  10.0    20

In [104]:
df = pd.DataFrame(
    { 'col1': [10, None],
      'col2': [20, 30],
    }
)
result = df.col1.isnull()
df.loc[result]

   col1  col2
1   NaN    30

In [106]:
df['col3'] = 33
df

   col1  col2  col3
0  10.0    20    33
1   NaN    30    33

In [107]:
df['col4'] = range(0, 2)
df

   col1  col2  col3  col4
0  10.0    20    33     0
1   NaN    30    33     1

In [109]:
df = pd.DataFrame(
    {
        "Apples": [35, 21],
        "Bananas": [41, 34]
    },
    index=["2017 Sales", "2018 Sales"]
)
df

            Apples  Bananas
2017 Sales      35       41
2018 Sales      21       34

In [111]:
df.loc['2018 Sales', 'Bananas'] = 43
df

            Apples  Bananas
2017 Sales      35       41
2018 Sales      21       43

In [112]:
df.iloc[0, 1] = 14
df

            Apples  Bananas
2017 Sales      35       14
2018 Sales      21       43

Not recommended way to set data for specific cell. Since it may not affect the original dataframe.

In [113]:
df['Apples']['2017 Sales'] = 53
df

C:\Users\arun.s\AppData\Local\Temp\ipykernel_8660\659381071.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Apples']['2017 Sales'] = 53

            Apples  Bananas
2017 Sales      53       14
2018 Sales      21       43